React_Module_Scripts/React_Substitute_Reports_Module/React_Substitute_Reports_api.yml
execution:
#- executor: jmeter
- concurrency: 100
  ramp-up: 100s
  hold-for: 50m
  scenario: React_Reports_Module.jmx

scenarios:
  React_Reports_Module:
    script: React_Reports_Module.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed